<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,1,224,224"/>
			<rt_info>
				<attribute name="fused_names" value="input.1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="input.1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_7079" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1, 384, 1, 1" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_7041" type="Const" version="opset1">
			<data element_type="f32" offset="1536" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_7027" type="Const" version="opset1">
			<data element_type="f32" offset="2304" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_7013" type="Const" version="opset1">
			<data element_type="f32" offset="2688" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="downsample_layers.0.0.weight" type="Const" version="opset1">
			<data element_type="f32" offset="3072" shape="96, 1, 4, 4" size="6144"/>
			<rt_info>
				<attribute name="fused_names" value="downsample_layers.0.0.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="downsample_layers.0.0.weight" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="4, 4"/>
			<rt_info>
				<attribute name="fused_names" value="Conv_0/WithoutBiases" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_207" type="Const" version="opset1">
			<data element_type="f32" offset="9216" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_206, Conv_0, Reshape_207" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="183" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_235" type="Const" version="opset1">
			<data element_type="i64" offset="9600" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_235" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Div_9" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="Add_7, Div_9, Pow_3, ReduceMean_1, ReduceMean_4, Sqrt_8, Sub_2" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="194" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Mul_10" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Mul_10" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" names="197" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_7014" type="Const" version="opset1">
			<data element_type="f32" offset="9608" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Add_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_11" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="200" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_255" type="Const" version="opset1">
			<data element_type="f32" offset="9992" shape="96, 1, 1, 7, 7" size="18816"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_12/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Conv_12/WithoutBiases, Reshape_255" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Reshape_341" type="Const" version="opset1">
			<data element_type="f32" offset="28808" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_340, Conv_12, Reshape_341" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="201" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_369" type="Const" version="opset1">
			<data element_type="i64" offset="29192" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_369" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Transpose_13" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Transpose_13" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="202" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_371" type="Const" version="opset1">
			<data element_type="i64" offset="29224" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_371" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Div_22" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="Add_20, Div_22, Pow_17, ReduceMean_14, ReduceMean_18, Sqrt_21, Sub_15" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="211" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_7015" type="Const" version="opset1">
			<data element_type="f32" offset="29232" shape="1, 1, 1, 96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Mul_23" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Mul_23" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="212" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_7016" type="Const" version="opset1">
			<data element_type="f32" offset="29616" shape="1, 1, 1, 96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Add_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_24" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="213" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_6273" type="Const" version="opset1">
			<data element_type="f32" offset="30000" shape="384, 96" size="147456"/>
			<rt_info>
				<attribute name="fused_names" value="813, MatMul_25" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="MatMul_25" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="813, MatMul_25" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="215" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_7017" type="Const" version="opset1">
			<data element_type="f32" offset="177456" shape="1, 1, 1, 384" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Add_26" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_26" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" names="216" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Mul_34" type="Gelu" version="opset7">
			<data approximation_mode="ERF"/>
			<rt_info>
				<attribute name="fused_names" value="Add_31, Div_28, Erf_29, Mul_32, Mul_34" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="224" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_6648" type="Const" version="opset1">
			<data element_type="f32" offset="178992" shape="96, 384" size="147456"/>
			<rt_info>
				<attribute name="fused_names" value="814, Add_36, MatMul_35, Mul_37, stages.0.0.gamma" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Multiply_6559" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="814, Add_36, MatMul_35, Mul_37, stages.0.0.gamma" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_7018" type="Const" version="opset1">
			<data element_type="f32" offset="326448" shape="1, 1, 1, 96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Mul_37" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_36, Mul_37" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="228" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_397" type="Const" version="opset1">
			<data element_type="i64" offset="326832" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_397" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Transpose_38" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Transpose_38" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="229" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Add_39" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_39" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" names="230" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_407" type="Const" version="opset1">
			<data element_type="f32" offset="326864" shape="96, 1, 1, 7, 7" size="18816"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_40/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Conv_40/WithoutBiases, Reshape_407" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_493" type="Const" version="opset1">
			<data element_type="f32" offset="345680" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_40" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_492, Conv_40, Reshape_493" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="231" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_521" type="Const" version="opset1">
			<data element_type="i64" offset="29192" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_521" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Transpose_41" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Transpose_41" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="232" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_523" type="Const" version="opset1">
			<data element_type="i64" offset="29224" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_523" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Div_50" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="Add_48, Div_50, Pow_45, ReduceMean_42, ReduceMean_46, Sqrt_49, Sub_43" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="241" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_7019" type="Const" version="opset1">
			<data element_type="f32" offset="346064" shape="1, 1, 1, 96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Mul_51" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Mul_51" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="242" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_7020" type="Const" version="opset1">
			<data element_type="f32" offset="346448" shape="1, 1, 1, 96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Add_52" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_52" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="243" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_6289" type="Const" version="opset1">
			<data element_type="f32" offset="346832" shape="384, 96" size="147456"/>
			<rt_info>
				<attribute name="fused_names" value="815, MatMul_53" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="MatMul_53" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="815, MatMul_53" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="245" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_7021" type="Const" version="opset1">
			<data element_type="f32" offset="494288" shape="1, 1, 1, 384" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Add_54" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_54" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" names="246" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Mul_62" type="Gelu" version="opset7">
			<data approximation_mode="ERF"/>
			<rt_info>
				<attribute name="fused_names" value="Add_59, Div_56, Erf_57, Mul_60, Mul_62" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="254" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_6667" type="Const" version="opset1">
			<data element_type="f32" offset="495824" shape="96, 384" size="147456"/>
			<rt_info>
				<attribute name="fused_names" value="816, Add_64, MatMul_63, Mul_65, stages.0.1.gamma" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Multiply_6563" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="816, Add_64, MatMul_63, Mul_65, stages.0.1.gamma" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_7022" type="Const" version="opset1">
			<data element_type="f32" offset="643280" shape="1, 1, 1, 96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Mul_65" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_64, Mul_65" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="258" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_549" type="Const" version="opset1">
			<data element_type="i64" offset="326832" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_549" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Transpose_66" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Transpose_66" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="259" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Add_67" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_67" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" names="260" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_559" type="Const" version="opset1">
			<data element_type="f32" offset="643664" shape="96, 1, 1, 7, 7" size="18816"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_68/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Conv_68/WithoutBiases, Reshape_559" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_645" type="Const" version="opset1">
			<data element_type="f32" offset="662480" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_68" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_644, Conv_68, Reshape_645" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="261" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_673" type="Const" version="opset1">
			<data element_type="i64" offset="29192" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_673" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Transpose_69" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Transpose_69" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="262" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_675" type="Const" version="opset1">
			<data element_type="i64" offset="29224" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_675" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Div_78" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="Add_76, Div_78, Pow_73, ReduceMean_70, ReduceMean_74, Sqrt_77, Sub_71" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="271" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_7023" type="Const" version="opset1">
			<data element_type="f32" offset="662864" shape="1, 1, 1, 96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Mul_79" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Mul_79" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="272" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_7024" type="Const" version="opset1">
			<data element_type="f32" offset="663248" shape="1, 1, 1, 96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Add_80" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_80" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="273" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_6305" type="Const" version="opset1">
			<data element_type="f32" offset="663632" shape="384, 96" size="147456"/>
			<rt_info>
				<attribute name="fused_names" value="817, MatMul_81" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="MatMul_81" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="817, MatMul_81" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="275" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_7025" type="Const" version="opset1">
			<data element_type="f32" offset="811088" shape="1, 1, 1, 384" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Add_82" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_82" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" names="276" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Mul_90" type="Gelu" version="opset7">
			<data approximation_mode="ERF"/>
			<rt_info>
				<attribute name="fused_names" value="Add_87, Div_84, Erf_85, Mul_88, Mul_90" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="284" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_6686" type="Const" version="opset1">
			<data element_type="f32" offset="812624" shape="96, 384" size="147456"/>
			<rt_info>
				<attribute name="fused_names" value="818, Add_92, MatMul_91, Mul_93, stages.0.2.gamma" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Multiply_6567" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="818, Add_92, MatMul_91, Mul_93, stages.0.2.gamma" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_7026" type="Const" version="opset1">
			<data element_type="f32" offset="960080" shape="1, 1, 1, 96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Mul_93" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_92, Mul_93" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="288" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_701" type="Const" version="opset1">
			<data element_type="i64" offset="326832" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_701" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Transpose_94" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Transpose_94" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="289" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Add_95" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_95" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" names="290" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_704" type="Const" version="opset1">
			<data element_type="i64" offset="9600" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_704" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Div_104" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="Add_102, Div_104, Pow_98, ReduceMean_96, ReduceMean_99, Sqrt_103, Sub_97" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="301" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Mul_105" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Mul_105" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" names="304" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_7028" type="Const" version="opset1">
			<data element_type="f32" offset="960464" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Add_106" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_106" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="307" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="downsample_layers.1.1.weight" type="Const" version="opset1">
			<data element_type="f32" offset="960848" shape="192, 96, 2, 2" size="294912"/>
			<rt_info>
				<attribute name="fused_names" value="downsample_layers.1.1.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="downsample_layers.1.1.weight" precision="FP32">
					<dim>192</dim>
					<dim>96</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_107/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="Conv_107/WithoutBiases" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>96</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape_737" type="Const" version="opset1">
			<data element_type="f32" offset="1255760" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_107" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_736, Conv_107, Reshape_737" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="308" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_772" type="Const" version="opset1">
			<data element_type="f32" offset="1256528" shape="192, 1, 1, 7, 7" size="37632"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_108/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Conv_108/WithoutBiases, Reshape_772" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Reshape_858" type="Const" version="opset1">
			<data element_type="f32" offset="1294160" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_108" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_857, Conv_108, Reshape_858" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="309" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_886" type="Const" version="opset1">
			<data element_type="i64" offset="29192" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_886" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Transpose_109" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Transpose_109" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="310" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_888" type="Const" version="opset1">
			<data element_type="i64" offset="29224" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_888" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Div_118" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="Add_116, Div_118, Pow_113, ReduceMean_110, ReduceMean_114, Sqrt_117, Sub_111" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="319" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_7029" type="Const" version="opset1">
