<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="125" name="input.1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,1,224,224"/>
			<rt_info>
				<attribute name="fused_names" value="input.1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="input.1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="0" name="2819282316297" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="2820282414467" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="2821282516273" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="2822282615664" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="Constant_316996214971" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_3169" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="2749275316264" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="2750275415382" type="Const" version="opset1">
			<data element_type="f32" offset="20" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="2751275514800" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="2752275614632" type="Const" version="opset1">
			<data element_type="f32" offset="20" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="2089209315718" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="2090209415268" type="Const" version="opset1">
			<data element_type="f32" offset="28" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="2091209515742" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="2092209616060" type="Const" version="opset1">
			<data element_type="f32" offset="28" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="1939194315466" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="1940194416039" type="Const" version="opset1">
			<data element_type="f32" offset="36" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="1941194516159" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="1942194616093" type="Const" version="opset1">
			<data element_type="f32" offset="36" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="3209321316000" type="Const" version="opset1">
			<data element_type="f32" offset="40" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="3210321414962" type="Const" version="opset1">
			<data element_type="f32" offset="44" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="3211321514395" type="Const" version="opset1">
			<data element_type="f32" offset="40" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="3212321616117" type="Const" version="opset1">
			<data element_type="f32" offset="44" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="2069207314614" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="2070207414989" type="Const" version="opset1">
			<data element_type="f32" offset="52" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="2071207516222" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="2072207615976" type="Const" version="opset1">
			<data element_type="f32" offset="52" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="3389339315361" type="Const" version="opset1">
			<data element_type="f32" offset="56" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="3390339416210" type="Const" version="opset1">
			<data element_type="f32" offset="60" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="3391339514629" type="Const" version="opset1">
			<data element_type="f32" offset="56" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="3392339615592" type="Const" version="opset1">
			<data element_type="f32" offset="60" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="Constant_707948814587" type="Const" version="opset1">
			<data element_type="f32" offset="64" shape="1,384,1,1" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_265087915319" type="Const" version="opset1">
			<data element_type="i64" offset="1600" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_2650" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="2489249314380" type="Const" version="opset1">
			<data element_type="f32" offset="1608" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="2490249416387" type="Const" version="opset1">
			<data element_type="f32" offset="1612" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="2491249515262" type="Const" version="opset1">
			<data element_type="f32" offset="1608" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="2492249615040" type="Const" version="opset1">
			<data element_type="f32" offset="1612" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="2589259315079" type="Const" version="opset1">
			<data element_type="f32" offset="1616" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="2590259414746" type="Const" version="opset1">
			<data element_type="f32" offset="1620" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="2591259515589" type="Const" version="opset1">
			<data element_type="f32" offset="1616" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="2592259614992" type="Const" version="opset1">
			<data element_type="f32" offset="1620" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="3489349315586" type="Const" version="opset1">
			<data element_type="f32" offset="1624" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="3490349415055" type="Const" version="opset1">
			<data element_type="f32" offset="1628" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="3491349516300" type="Const" version="opset1">
			<data element_type="f32" offset="1624" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="3492349616396" type="Const" version="opset1">
			<data element_type="f32" offset="1628" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="2899290315067" type="Const" version="opset1">
			<data element_type="f32" offset="1632" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="2900290414875" type="Const" version="opset1">
			<data element_type="f32" offset="1636" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="2901290515214" type="Const" version="opset1">
			<data element_type="f32" offset="1632" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="2902290614833" type="Const" version="opset1">
			<data element_type="f32" offset="1636" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="47" name="2349235315769" type="Const" version="opset1">
			<data element_type="f32" offset="1640" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="48" name="2350235416279" type="Const" version="opset1">
			<data element_type="f32" offset="1644" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="2351235514680" type="Const" version="opset1">
			<data element_type="f32" offset="1640" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="50" name="2352235614845" type="Const" version="opset1">
			<data element_type="f32" offset="1644" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="2689269316456" type="Const" version="opset1">
			<data element_type="f32" offset="1648" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="2690269415844" type="Const" version="opset1">
			<data element_type="f32" offset="1652" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="2691269516141" type="Const" version="opset1">
			<data element_type="f32" offset="1648" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="2692269614869" type="Const" version="opset1">
			<data element_type="f32" offset="1652" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="2219222314860" type="Const" version="opset1">
			<data element_type="f32" offset="1656" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="2220222415001" type="Const" version="opset1">
			<data element_type="f32" offset="1660" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="2221222516075" type="Const" version="opset1">
			<data element_type="f32" offset="1656" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="2222222616069" type="Const" version="opset1">
			<data element_type="f32" offset="1660" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="3049305316246" type="Const" version="opset1">
			<data element_type="f32" offset="1664" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="3050305414911" type="Const" version="opset1">
			<data element_type="f32" offset="1668" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="3051305514356" type="Const" version="opset1">
			<data element_type="f32" offset="1664" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="3052305615301" type="Const" version="opset1">
			<data element_type="f32" offset="1668" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="1869187314944" type="Const" version="opset1">
			<data element_type="f32" offset="1672" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="1870187415148" type="Const" version="opset1">
			<data element_type="f32" offset="1676" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="1871187516078" type="Const" version="opset1">
			<data element_type="f32" offset="1672" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="1872187615739" type="Const" version="opset1">
			<data element_type="f32" offset="1676" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="2549255314728" type="Const" version="opset1">
			<data element_type="f32" offset="1680" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="2550255416198" type="Const" version="opset1">
			<data element_type="f32" offset="1684" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="2551255514734" type="Const" version="opset1">
			<data element_type="f32" offset="1680" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="2552255615112" type="Const" version="opset1">
			<data element_type="f32" offset="1684" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="3549355315238" type="Const" version="opset1">
			<data element_type="f32" offset="1688" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="3550355415346" type="Const" version="opset1">
			<data element_type="f32" offset="1692" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="3551355515127" type="Const" version="opset1">
			<data element_type="f32" offset="1688" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="74" name="3552355615643" type="Const" version="opset1">
			<data element_type="f32" offset="1692" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="75" name="Constant_704148915790" type="Const" version="opset1">
			<data element_type="f32" offset="1696" shape="1,192,1,1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_122165414821" type="Const" version="opset1">
			<data element_type="i64" offset="1600" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1221" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="1999200315373" type="Const" version="opset1">
			<data element_type="f32" offset="2464" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="2000200416363" type="Const" version="opset1">
			<data element_type="f32" offset="2468" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="2001200514410" type="Const" version="opset1">
			<data element_type="f32" offset="2464" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="2002200614482" type="Const" version="opset1">
			<data element_type="f32" offset="2468" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="81" name="2039204315328" type="Const" version="opset1">
			<data element_type="f32" offset="2472" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="82" name="2040204414419" type="Const" version="opset1">
			<data element_type="f32" offset="2476" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="83" name="2041204514572" type="Const" version="opset1">
			<data element_type="f32" offset="2472" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="84" name="2042204615535" type="Const" version="opset1">
			<data element_type="f32" offset="2476" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="2409241316033" type="Const" version="opset1">
			<data element_type="f32" offset="2480" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="86" name="2410241414314" type="Const" version="opset1">
			<data element_type="f32" offset="2484" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="2411241514365" type="Const" version="opset1">
			<data element_type="f32" offset="2480" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="2412241615376" type="Const" version="opset1">
			<data element_type="f32" offset="2484" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="2919292314662" type="Const" version="opset1">
			<data element_type="f32" offset="2488" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="2920292416003" type="Const" version="opset1">
			<data element_type="f32" offset="2492" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="2921292515481" type="Const" version="opset1">
			<data element_type="f32" offset="2488" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="2922292616420" type="Const" version="opset1">
			<data element_type="f32" offset="2492" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="2279228315484" type="Const" version="opset1">
			<data element_type="f32" offset="2496" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="2280228414782" type="Const" version="opset1">
			<data element_type="f32" offset="2500" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="2281228516390" type="Const" version="opset1">
			<data element_type="f32" offset="2496" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="2282228615409" type="Const" version="opset1">
			<data element_type="f32" offset="2500" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="Constant_702749014932" type="Const" version="opset1">
			<data element_type="f32" offset="2504" shape="1,96,1,1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_70457314848" type="Const" version="opset1">
			<data element_type="i64" offset="1600" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_704" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="2449245314794" type="Const" version="opset1">
			<data element_type="f32" offset="2888" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="100" name="2450245414413" type="Const" version="opset1">
			<data element_type="f32" offset="2892" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="2451245514671" type="Const" version="opset1">
			<data element_type="f32" offset="2888" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="2452245615103" type="Const" version="opset1">
			<data element_type="f32" offset="2892" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="3129313314335" type="Const" version="opset1">
			<data element_type="f32" offset="2896" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="3130313415256" type="Const" version="opset1">
			<data element_type="f32" offset="2900" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="3131313515469" type="Const" version="opset1">
			<data element_type="f32" offset="2896" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="3132313616147" type="Const" version="opset1">
			<data element_type="f32" offset="2900" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="2469247315706" type="Const" version="opset1">
			<data element_type="f32" offset="2904" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="2470247415259" type="Const" version="opset1">
			<data element_type="f32" offset="2908" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="2471247515463" type="Const" version="opset1">
			<data element_type="f32" offset="2904" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="110" name="2472247614533" type="Const" version="opset1">
			<data element_type="f32" offset="2908" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="111" name="3449345316513" type="Const" version="opset1">
			<data element_type="f32" offset="2912" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="112" name="3450345415541" type="Const" version="opset1">
			<data element_type="f32" offset="2916" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="113" name="3451345516510" type="Const" version="opset1">
			<data element_type="f32" offset="2912" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="114" name="3452345615673" type="Const" version="opset1">
			<data element_type="f32" offset="2916" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="115" name="Constant_701349114743" type="Const" version="opset1">
			<data element_type="f32" offset="2920" shape="1,96,1,1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_23549615991" type="Const" version="opset1">
			<data element_type="i64" offset="1600" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_235" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="3569357315331" type="Const" version="opset1">
			<data element_type="f32" offset="3304" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="3570357415406" type="Const" version="opset1">
			<data element_type="f32" offset="3308" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="3571357516048" type="Const" version="opset1">
			<data element_type="f32" offset="3304" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="3572357614938" type="Const" version="opset1">
			<data element_type="f32" offset="3308" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="2959296315877" type="Const" version="opset1">
			<data element_type="f32" offset="3312" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="2960296415964" type="Const" version="opset1">
			<data element_type="f32" offset="3316" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="123" name="2961296515199" type="Const" version="opset1">
			<data element_type="f32" offset="3312" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="124" name="2962296615070" type="Const" version="opset1">
			<data element_type="f32" offset="3316" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="Conv_0/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="downsample_layers.0.0.weight4928476/quantized1090314908" type="Const" version="opset1">
			<data element_type="i8" offset="3320" shape="96,1,4,4" size="1536"/>
			<output>
				<port id="0" precision="I8">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="downsample_layers.0.0.weight4928476/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Conv_0/WithoutBiases/fq_weights_1/zero_point1092215163" type="Const" version="opset1">
			<data element_type="f32" offset="4856" shape="96,1,1,1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Conv_0/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Conv_0/WithoutBiases/fq_weights_1/scale1091115454" type="Const" version="opset1">
			<data element_type="f32" offset="5240" shape="96,1,1,1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Conv_0/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="4,4"/>
			<rt_info>
				<attribute name="fused_names" value="Conv_0/WithoutBiases" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Reshape_20749415823" type="Const" version="opset1">
			<data element_type="f32" offset="5624" shape="1,96,1,1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_206, Conv_0, Reshape_207" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="183" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Div_9/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Div_9" type="MVN" version="opset6">
			<data eps="9.999999974752427e-07" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="Add_7, Div_9, Pow_3, ReduceMean_1, ReduceMean_4, Sqrt_8, Sub_2" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="194" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Mul_10" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Mul_10" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" names="197" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Constant_701449914371" type="Const" version="opset1">
			<data element_type="f32" offset="6008" shape="1,96,1,1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="Add_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_11" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="200" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Add_39/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="4675467915967" type="Const" version="opset1">
			<data element_type="f32" offset="6392" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="143" name="4676468016009" type="Const" version="opset1">
			<data element_type="f32" offset="6396" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="4677468115004" type="Const" version="opset1">
			<data element_type="f32" offset="6392" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="145" name="4678468214569" type="Const" version="opset1">
			<data element_type="f32" offset="6396" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="146" name="3279328316294" type="Const" version="opset1">
			<data element_type="f32" offset="6400" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="147" name="3280328416318" type="Const" version="opset1">
			<data element_type="f32" offset="6404" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="148" name="3281328515814" type="Const" version="opset1">
			<data element_type="f32" offset="6400" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="149" name="3282328615130" type="Const" version="opset1">
			<data element_type="f32" offset="6404" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="150" name="2609261316408" type="Const" version="opset1">
			<data element_type="f32" offset="6408" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="151" name="2610261415505" type="Const" version="opset1">
			<data element_type="f32" offset="6412" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="152" name="2611261516330" type="Const" version="opset1">
			<data element_type="f32" offset="6408" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="153" name="2612261615388" type="Const" version="opset1">
			<data element_type="f32" offset="6412" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="154" name="Constant_37150714506" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_371" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="4805480915682" type="Const" version="opset1">
			<data element_type="f32" offset="6416" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="156" name="4806481015910" type="Const" version="opset1">
			<data element_type="f32" offset="6420" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="157" name="4807481114602" type="Const" version="opset1">
			<data element_type="f32" offset="6416" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="158" name="4808481215865" type="Const" version="opset1">
			<data element_type="f32" offset="6420" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="159" name="12672/value1267416240" type="Const" version="opset1">
			<data element_type="i64" offset="6424" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="Reshape_2555018480/quantized991314503" type="Const" version="opset1">
			<data element_type="i8" offset="6464" shape="96,1,7,7" size="4704"/>
			<output>
				<port id="0" precision="I8">
					<dim>96</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="161" name="Reshape_2555018480/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="162" name="Conv_12/WithoutBiases/fq_weights_1/zero_point993214551" type="Const" version="opset1">
			<data element_type="f32" offset="11168" shape="96,1,1,1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="163" name="Conv_12/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="164" name="Conv_12/WithoutBiases/fq_weights_1/scale992116276" type="Const" version="opset1">
			<data element_type="f32" offset="11552" shape="96,1,1,1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="165" name="Conv_12/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="166" name="12672" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="167" name="Conv_12/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<rt_info>
				<attribute name="fused_names" value="Conv_12/WithoutBiases, Reshape_255" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="168" name="Reshape_34150316423" type="Const" version="opset1">
			<data element_type="f32" offset="11936" shape="1,96,1,1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="169" name="Conv_12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_340, Conv_12, Reshape_341" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="201" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="170" name="Transpose_13/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="171" name="Constant_369505" type="Const" version="opset1">
			<data element_type="i64" offset="12320" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_369" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="172" name="Transpose_13" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Transpose_13" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="202" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="173" name="Div_22" type="MVN" version="opset6">
			<data eps="9.999999974752427e-07" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="Add_20, Div_22, Pow_17, ReduceMean_14, ReduceMean_18, Sqrt_21, Sub_15" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="211" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="174" name="Constant_701550914383" type="Const" version="opset1">
			<data element_type="f32" offset="12352" shape="1,1,1,96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="175" name="Mul_23" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Mul_23" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="212" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="176" name="Constant_701651115802" type="Const" version="opset1">
			<data element_type="f32" offset="12736" shape="1,1,1,96" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="177" name="Add_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Add_24" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="213" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="178" name="MatMul_25/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="179" name="Constant_62735138486/quantized958316462" type="Const" version="opset1">
			<data element_type="i8" offset="13120" shape="384,96" size="36864"/>
			<output>
				<port id="0" precision="I8">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="180" name="Constant_62735138486/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="181" name="MatMul_25/fq_weights_1/zero_point960214950" type="Const" version="opset1">
			<data element_type="f32" offset="49984" shape="384,1" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="182" name="MatMul_25/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>384</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="183" name="MatMul_25/fq_weights_1/scale959115433" type="Const" version="opset1">
			<data element_type="f32" offset="51520" shape="384,1" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="184" name="MatMul_25/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>384</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="185" name="MatMul_25" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="813, MatMul_25" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>384</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="215" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>56</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="186" name="Constant_701751516315" type="Const" version="opset1">
			<data element_type="f32" offset="53056" shape="1,1,1,384" size="1536"/>
			<output>
